app/Controllers/Artikel.php

    public function edit($id)
    {
        $artikel    = new ArtikelModel();
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi'   => $this->request->getPost('isi'),
            ]);
            return redirect('admin/artikel');
        }

        // Ambil data lama untuk ditampilkan di form
        $data  = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1